**1.Common Prefix**

Given a list of strings, write a function that returns their longest common prefix. For example, if you were given the strings “flowers”, “flow”, and “flight”, your function should return the string “fl”.

In [249]:
def common_prefix(strings):

    return ""

In [135]:
strings1 = ["flowers", "flow", "flight"] 
strings2 = ["showboat", "showcase", "shower"]
strings3 = ["fourteen", "four", "fourth", "foul", "fourths", "forgotten"]

In [136]:
print(common_prefix(strings1))
print(common_prefix(strings2))
print(common_prefix(strings3))

fl
show
fo

**2.Maximum Values**
Given a dictionary, return the key value(s) of the maximum values.

In [152]:
def maxKeys(dictionary):
    
    return ""

In [154]:
ages = {
    'Matt': 30,
    'Katie': 40,
    'Nik': 31,
    'Jack': 40,
    'Jill': 43,
    'Alison': 32,
    'Kevin': 33
}

print(maxKeys(ages))

['Jill']

**3. Split Name into FirstName and LastName (two new columns) and delete the Name column**

In [160]:
import pandas as pd
students = {"name" : ["Tim Voss", "Nicole Johnson", "Elsa Williams", "John James", "Catherine Jones"], "age" : [19, 20, 21, 20, 23], "favorite_color" : ["red", "yellow", "green", "blue", "green"], "grade" : [91, 95, 82, 75, 93]}

students_df = pd.DataFrame(students)

In [161]:
students_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
1   Nicole Johnson   20         yellow     95
2    Elsa Williams   21          green     82
3       John James   20           blue     75
4  Catherine Jones   23          green     93

In [316]:
#enter your code here

   age favorite_color  grade  FirstName  LastName
0   19            red     91        Tim      Voss
1   20         yellow     95     Nicole   Johnson
2   21          green     82       Elsa  Williams
3   20           blue     75       John     James
4   23          green     93  Catherine     Jones

**4. Find Mismatched Words**

You are given two sentences as strings. Create a function that returns a list of all words that are not in both sentences.

In [251]:
string1 = "I want to eat fish today with my friends game"
string2 = "All I want is to eat fish today well with my friends game"

In [254]:
def mismatched_words(string1, string2):
    #write your function here
    return ""

In [253]:
mismatched_words(string1,string2)

['All', 'is', 'well']

**5. Fill None Values**

Given a sorted list of positive integers with some entries being None, create a function to return a new list where all None values are replaced with the most recent non-None value in the list.

Note: If the first entry in the list is None, assume the previous entry was 0.

In [256]:
def fill_none(input_list):
    
    return ""

In [255]:
input_list = [1,2,None,None,4,5,None]
fill_none(input_list)

[1, 2, 2, 2, 4, 5, 5]

**6. Two Sum**

Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.

You may assume that each input would have exactly one solution, and you may not use the same element twice.

In [257]:
def twoSum(nums, target):
    
    return ""

In [168]:
nums = [2,5,11,15,7]
target = 9
twoSum(nums, target)

[0, 4]

In [169]:
nums = [3,2,4]
target = 6
twoSum(nums, target)

[1, 2]

**7. New Resumes**

You have a list of employee ids. Your web folder has a list of resumes some old (exisiting emoployees), some new (new applicants)

In [281]:
def new_resumes(ids,names,resumes):

    return ""

In [282]:
employee_ids = [15234, 20485, 34536, 95342, 94857]

names = ['Mark', 'Jackson', 'Suzan', 'Kelly']
resumes = [
    'employees/resume/15234', 
    'employees/resume/23645', 
    'employees/resume/64337', 
    'employees/resume/34536',
]

In [267]:
new_resumes(existing_ids,names,urls)

[('Jackson', 23645), ('Suzan', 64337)]

**8. Most Tips**

Given a list of ids of customers and list of tips of these customers, find the customer ID with highest tip

In [295]:
user_ids = [103, 105, 105, 107, 106, 103, 102, 108, 107, 103, 102]
tips = [2, 5, 1, 0, 2, 1, 1, 0, 0, 20, 2]

In [297]:
import collections

def most_tips(user_ids,tips):

    return ""

In [181]:
most_tips(user_ids,tips)

103

**9. Encode a Message**

Given a code made up of a reperated letters, encode it into each uniqe letter and num of times it is repeated (treat upper and lower case as different values)

In [300]:
import collections 
def compress2(text):
    
    return ""

In [299]:
compress2("AAAABBBBCCCCCDDEEEEaaA")

'A5B4C5D2E4a2'